Test/airFoil2D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    lacation    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Re=2.86e6 ; I=0.16*Re**(-1/8)=0.0227

// ***I = 0.001 *** 

// k=(3/2)*(U_ref * I)**2=1.22e-2

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.88;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    exit
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    bottom
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    top
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    aerofoil
    {
        type            kLowReWallFunction;
        // type            kqRWallFunction;
        value           $internalField;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
