Test/airFoil2D/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    exit
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    bottom
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    top
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    aerofoil
    {
        type            calculated;
        value           nonuniform List<vector> 
817
(
(-62.8434 -2.76393 -0)
(-62.4142 -0.736674 -0)
(-62.3544 -0.719409 -3.81157e-21)
(-62.6899 -2.84524 -0)
(-83.2 0 0)
(-62.7008 -2.82738 -0)
(-62.7032 -2.83733 -0)
(-62.6742 -2.78001 -0)
...
)
;
    }
}


// ************************************************************************* //
